Revit 2027 API
DirectShape Methods
The DirectShape type exposes the following members.
Methods
Name | Description
AddExternallyTaggedGeometry |  Adds the externally tagged geometry object to the DirectShape.
AddReferenceCurve(Curve) |  Adds a reference curve to the DirectShape.
AddReferenceCurve(Curve, DirectShapeReferenceOptions) |  Adds a reference curve to the DirectShape.
AddReferencePlane(Plane) |  Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, BoundingBoxUV) |  Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, DirectShapeReferenceOptions) |  Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, BoundingBoxUV, DirectShapeReferenceOptions) |  Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
AddReferencePoint(XYZ) |  Adds a reference point to the DirectShape.
AddReferencePoint(XYZ, DirectShapeReferenceOptions) |  Adds a reference point to the DirectShape.
AppendShape(IList<GeometryObject>) |  Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
AppendShape(ShapeBuilder) |  Appends shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShape. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
AreOptionsValid |  Validates that the given DirectShapeOptions are allowed for this particular DirectShape.
AreOptionsValidForTransientDirectShape |  Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
AreValidDirectShapeReferenceOptions |  Validates that the input DirectShapeReferenceOptions are suitable for creating a direct shape reference object. If the options specify an ExternalGeometryId, it must not correspond to any existing reference object belonging to the DirectShape.
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanCreateParts |  Indicates if it is possible to create parts from this DirectShape element.
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
CreateElement |  Creates a DirectShape object and adds it to document.
CreateElementInstance |  Creates a DirectShape object and adds it to document.
CreateGeometryInstance |  Creates a copy of a definition shape that was created earlier.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternallyTaggedGeometry |  Gets the externally tagged geometry by its external ID that is stored in this DirectShape.
GetExternallyTaggedReference |  Retrieve a Reference to reference geometry of the DirectShape that is associated with a particular ExternalGeometryId.
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOptions |  Gets a copy of the current options for this DirectShape.
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasExternalGeometry |  Checks whether the externally tagged geometry is already present in this DirectShape.
HasExternallyTaggedReference |  Checks if the externally tagged reference is already present in this DirectShape.
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsSupportedDocument |  Tests whether a DirectShape or a DirectShapeType may be created in this document.
IsValidCategoryId |  Test the category id to make sure the category is allowed for a DirectShape or DirectShapeType.
IsValidGeometry |  Validates geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry must make sense as a shape representation for the category assigned to this DirectShape object.
IsValidReferenceCurve |  Validates that the input curve is suitable for creating a direct shape reference curve. Bounded and unbounded lines are accepted. Other bounded and unbounded curve types with natural bounds are accepted if they are not closed. Unbounded periodic curves are not allowed.
IsValidReferencePlaneBoundingBoxUV |  Validates that the input BoundingBoxUV is suitable for bounding a reference plane surface. The input BoundingBoxUV must be set and not degenerate.
IsValidShape(ExternallyTaggedGeometryObject) |  Validates shape to be stored in a DirectShape.
IsValidShape(IList<GeometryObject>) |  Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry().
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type.
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
IsValidTypeId |  Tests the type id to make sure it satisfies the following conditions
It is a valid element id.
It corresponds to a valid DirectShapeType.
The DirectShapeType has the same category assigned.
 Additionally, this functions tests that the current type id in this DirectShape is invalid. The type id is initialized to invalidElementId by the create functions. Once it is set, it may no longer be changed.
IsValidUsage |  Validates that the ExternallyTaggedGeometryObject's usage is set to an allowed value for a DirectShape.
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
RemoveAllReferenceObjects |  Removes all reference objects (if any) from the DirectShape.
RemoveExternallyTaggedGeometry |  Removes the externally tagged geometry object by its external ID from this DirectShape.
RemoveReferenceObject(ExternalGeometryId) |  Removes any reference object associated with the provided ExternalGeometryId from the DirectShape. Nothing is done if no reference object has the given external ID or if the external ID is an empty string.
RemoveReferenceObject(String) |  Removes any reference objects with the given name from the DirectShape. Nothing is done if no reference objects have the given name or if the name is the empty string.
ResetExternallyTaggedGeometry |  Removes all of the externally tagged geometry in this DirectShape.
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
SetName |  Sets the name for the DirectShape element.
SetOptions |  Sets the options to use for this DirectShape.
SetShape(IList<GeometryObject>) |  Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetShape(ShapeBuilder) |  Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept.
SetShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetTypeId |  Sets the DirectShapeType for the DirectShape element.
ToString | Returns a string that represents the current object.
(Inherited from Object)
UpdateExternallyTaggedGeometry |  Updates the externally tagged geometry object in the DirectShape.
Top
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace